## Anticipating Data Cleaning Issues when Importing Tabular Data into pandas

Importing CSV files<br>
Importing Excel files<br>
Importing data from SQL databases<br>
Importing SPSS, Stata, and SAS data<br>
Importing R data<br>
Persisting tabular data<br>

In [1]:
import pandas as pd

In [2]:
pd.options.display.float_format = '{:,.2f}'.format
pd.set_option('display.width', 85)
pd.set_option('display.max_columns', 8)

In [4]:
landtemps = pd.read_csv('data/landtempssample.csv', names=['stationid','year','month','avgtemp','latitude','longitude','elevation','station','countryid','country'],\
                        skiprows=1,parse_dates=[['month','year']],low_memory=False)

In [5]:
landtemps.head()

,month_year,stationid,avgtemp,latitude,...,elevation,station,countryid,country
0,2000-04-01,USS0010K01S,5.27,39.90,...,"2,773.70",INDIAN_CANYON,US,United States
1,1940-05-01,CI000085406,18.04,-18.35,...,58.00,ARICA,CI,Chile
2,2013-12-01,USC00036376,6.22,34.37,...,61.00,SAINT_CHARLES,US,United States
3,1963-02-01,ASN00024002,22.93,-34.28,...,65.50,BERRI_IRRIGATION,AS,Australia
4,2001-11-01,ASN00028007,nan,-14.78,...,79.40,MUSGRAVE,AS,Australia

In [6]:
type( landtemps)

pandas.core.frame.DataFrame

In [7]:
landtemps.dtypes

month_year    datetime64[ns]
stationid             object
avgtemp              float64
latitude             float64
longitude            float64
elevation            float64
station               object
countryid             object
country               object
dtype: object

In [8]:
landtemps.shape

(100000, 9)

In [9]:
# Give the date column a better name and view the summary statistics for average monthly temperature:
landtemps.rename(columns={'month_year':'measuredate'}, inplace=True)

In [10]:
landtemps.dtypes

measuredate    datetime64[ns]
stationid              object
avgtemp               float64
latitude              float64
longitude             float64
elevation             float64
station                object
countryid              object
country                object
dtype: object

In [11]:
landtemps.avgtemp.describe()

count   85,554.00
mean        10.92
std         11.52
min        -70.70
25%          3.46
50%         12.22
75%         19.57
max         39.95
Name: avgtemp, dtype: float64

In [12]:
landtemps.isnull().sum()

measuredate        0
stationid          0
avgtemp        14446
latitude           0
longitude          0
elevation          0
station            0
countryid          0
country            5
dtype: int64

In [13]:
# Remove rows with missing data for avgtemp
landtemps.dropna(subset=['avgtemp'], inplace=True)

In [14]:
landtemps.shape

(85554, 9)

In [15]:
checknull = landtemps.isnull()
checknull.sum()

measuredate    0
stationid      0
avgtemp        0
latitude       0
longitude      0
elevation      0
station        0
countryid      0
country        2
dtype: int64

In [18]:
#landtemps = pd.read_csv('data/landtemps.zip', compression='zip',names=['stationid','year','month','avgtemp','latitude','longitude','elevation','station','countryid','country'],skiprows=1,parse_dates=[['month','year']], low_memory=False)

In [3]:
percapitaGDP = pd.read_excel("data/GDPpercapita.xlsx",sheet_name="OECD.Stat export",skiprows=4,skipfooter=1,usecols="A,C:T")

In [20]:
percapitaGDP.head()

                         Year   2001   2002   2003  ...   2015   2016   2017   2018
0          Metropolitan areas    NaN    NaN    NaN  ...    NaN    NaN    NaN    NaN
1              AUS: Australia     ..     ..     ..  ...     ..     ..     ..     ..
2       AUS01: Greater Sydney  43313  44008  45424  ...  50075  50519  50578  49860
3    AUS02: Greater Melbourne  40125  40894  41602  ...  42928  42671  43025  42674
4     AUS03: Greater Brisbane  37580  37564  39080  ...  44388  45723  46876  46640

[5 rows x 19 columns]

In [21]:
percapitaGDP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 702 entries, 0 to 701
Data columns (total 19 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    702 non-null    object
 1   2001    701 non-null    object
 2   2002    701 non-null    object
 3   2003    701 non-null    object
 4   2004    701 non-null    object
 5   2005    701 non-null    object
 6   2006    701 non-null    object
 7   2007    701 non-null    object
 8   2008    701 non-null    object
 9   2009    701 non-null    object
 10  2010    701 non-null    object
 11  2011    701 non-null    object
 12  2012    701 non-null    object
 13  2013    701 non-null    object
 14  2014    701 non-null    object
 15  2015    701 non-null    object
 16  2016    701 non-null    object
 17  2017    701 non-null    object
 18  2018    701 non-null    object
dtypes: object(19)
memory usage: 104.3+ KB

In [22]:
#Rename the Year column to metro and remove the leading spaces
percapitaGDP.rename(columns={'Year':'metro'}, inplace=True)

In [24]:
# We use strip to remove both leading and trailing spaces

percapitaGDP.metro.str.startswith(' ').any()

True

In [25]:
percapitaGDP.metro.str.endswith(' ').any()

True

In [26]:
percapitaGDP.metro = percapitaGDP.metro.str.strip()

In [27]:
# Convert the data columns to numeric
for col in percapitaGDP.columns[1:]:
    percapitaGDP[col] = pd.to_numeric(percapitaGDP[col], errors='coerce')
    percapitaGDP.rename(columns={col:'pcGDP'+col},inplace=True)

In [29]:
percapitaGDP.head(3)

,metro,pcGDP2001,pcGDP2002,pcGDP2003,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
0,Metropolitan areas,nan,nan,nan,...,nan,nan,nan,nan
1,AUS: Australia,nan,nan,nan,...,nan,nan,nan,nan
2,AUS01: Greater Sydney,"43,313.00","44,008.00","45,424.00",...,"50,075.00","50,519.00","50,578.00","49,860.00"

In [30]:
percapitaGDP.dtypes

metro         object
pcGDP2001    float64
pcGDP2002    float64
pcGDP2003    float64
pcGDP2004    float64
pcGDP2005    float64
pcGDP2006    float64
pcGDP2007    float64
pcGDP2008    float64
pcGDP2009    float64
pcGDP2010    float64
pcGDP2011    float64
pcGDP2012    float64
pcGDP2013    float64
pcGDP2014    float64
pcGDP2015    float64
pcGDP2016    float64
pcGDP2017    float64
pcGDP2018    float64
dtype: object

In [4]:
percapitaGDP.describe()

                        Year 2001 2002 2003  ... 2015 2016 2017 2018
count                    702  701  701  701  ...  701  701  701  701
unique                   702  422  438  439  ...  479  480  445  440
top       CL004: Antofagasta   ..   ..   ..  ...   ..   ..   ..   ..
freq                       1  277  261  261  ...  221  221  256  260

[4 rows x 19 columns]

In [5]:
percapitaGDP.columns[1:]

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018'],
      dtype='object')

In [6]:
# Remove rows where all of the per capita GDP values are missing
percapitaGDP.dropna(subset=percapitaGDP.columns[1:], how="all", inplace=True)

In [7]:
percapitaGDP.describe()

                        Year 2001 2002 2003  ... 2015 2016 2017 2018
count                    701  701  701  701  ...  701  701  701  701
unique                   701  422  438  439  ...  479  480  445  440
top       CL004: Antofagasta   ..   ..   ..  ...   ..   ..   ..   ..
freq                       1  277  261  261  ...  221  221  256  260

[4 rows x 19 columns]

In [8]:
percapitaGDP.head()

                         Year   2001   2002   2003  ...   2015   2016   2017   2018
1              AUS: Australia     ..     ..     ..  ...     ..     ..     ..     ..
2       AUS01: Greater Sydney  43313  44008  45424  ...  50075  50519  50578  49860
3    AUS02: Greater Melbourne  40125  40894  41602  ...  42928  42671  43025  42674
4     AUS03: Greater Brisbane  37580  37564  39080  ...  44388  45723  46876  46640
5        AUS04: Greater Perth  45713  47371  48719  ...  66544  66032  66424  70390

[5 rows x 19 columns]

## Importing data from SQL databases

import numpy as np<br>
import pymssql<br>
import mysql.connector<br>

query = "SELECT studentid, school, sex, age, famsize,medu AS mothereducation, fedu AS fathereducation,traveltime, studytime, failures, famrel, freetime,
goout, g1 AS gradeperiod1, g2 AS gradeperiod2,g3 AS gradeperiod3 From studentmath"

server = "pdcc.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"<br>

user = "pdccuser"<br>
password = "pdccpass"<br>
database = "pdcctest"<br>

conn = pymssql.connect(server=server,user=user, password=password, database=database)<br>
studentmath = pd.read_sql(query,conn)<br>
conn.close()<br>

### one more example

connmysql = mysql.connector.connect(host=host,database=database,user=user,password=password)<br>
studentmath = pd.read_sql(sqlselect,connmysql)<br>
connmysql.close()<br>

## Importing SPSS, Stata, and SAS data

In [14]:
import pyreadstat

In [15]:
nls97spss, metaspss = pyreadstat.read_sav('data/nls97.sav')

In [16]:
nls97spss.dtypes

R0000100    float64
R0536300    float64
R0536401    float64
R0536402    float64
R1235800    float64
R1482600    float64
R9793800    float64
R9793900    float64
R9871900    float64
R9872000    float64
R9872200    float64
R9872400    float64
S8646900    float64
S8647000    float64
S8647100    float64
S8647200    float64
S8647300    float64
S8647400    float64
S8647500    float64
S8647600    float64
S8647700    float64
S8647800    float64
T6651700    float64
U1836800    float64
U1836900    float64
U1837000    float64
U1837100    float64
U1837200    float64
U1837300    float64
U1845400    float64
U1852400    float64
U1852600    float64
U1852700    float64
U2166200    float64
U2166300    float64
U2166400    float64
U2166500    float64
U2857300    float64
U2962800    float64
U2962900    float64
U2963000    float64
Z9063900    float64
dtype: object

In [19]:
nls97spss.head()

,R0000100,R0536300,R0536401,R0536402,...,U2962800,U2962900,U2963000,Z9063900
0,1.00,2.00,9.00,"1,981.00",...,nan,nan,nan,52.00
1,2.00,1.00,7.00,"1,982.00",...,4.00,2.00,6.00,0.00
2,3.00,2.00,9.00,"1,983.00",...,6.00,2.00,6.00,0.00
3,4.00,2.00,2.00,"1,981.00",...,3.00,2.00,6.00,4.00
4,5.00,1.00,10.00,"1,982.00",...,2.00,2.00,5.00,12.00

In [20]:
nls97spss['R0536300'].value_counts(normalize=True)

1.00   0.51
2.00   0.49
Name: R0536300, dtype: float64

In [22]:
nls97spss['R0536300'].value_counts()

1.00    4599
2.00    4385
Name: R0536300, dtype: int64

In [23]:
# Grab the metadata to improve column labels and value labels

metaspss.variable_value_labels['R0536300']

{0.0: 'No Information', 1.0: 'Male', 2.0: 'Female'}

In [27]:
nls97spss['R0536300'].head()

0   2.00
1   1.00
2   2.00
3   2.00
4   1.00
Name: R0536300, dtype: float64

In [24]:
nls97spss['R0536300'].map(metaspss.variable_value_labels['R0536300'])

0       Female
1         Male
2       Female
3       Female
4         Male
         ...
8979    Female
8980      Male
8981      Male
8982      Male
8983    Female
Name: R0536300, Length: 8984, dtype: object

In [25]:
nls97spss['R0536300'].map(metaspss.variable_value_labels['R0536300']).value_counts(normalize=True)

Male     0.51
Female   0.49
Name: R0536300, dtype: float64

In [28]:
nls97spss = pyreadstat.set_value_labels(nls97spss, metaspss, formats_as_category=True)

In [29]:
nls97spss.columns = metaspss.column_labels

In [30]:
nls97spss['KEY!SEX (SYMBOL) 1997'].value_counts(normalize=True)

Male     0.51
Female   0.49
Name: KEY!SEX (SYMBOL) 1997, dtype: float64

In [31]:
nls97spss.dtypes

PUBID - YTH ID CODE 1997                        float64
KEY!SEX (SYMBOL) 1997                          category
KEY!BDATE M/Y (SYMBOL) 1997                     float64
KEY!BDATE M/Y (SYMBOL) 1997                     float64
CV_SAMPLE_TYPE 1997                            category
KEY!RACE_ETHNICITY (SYMBOL) 1997               category
TRANS_SAT_VERBAL HSTR                           float64
TRANS_SAT_MATH HSTR                             float64
TRANS CRD GPA OVERALL HSTR                      float64
TRANS CRD GPA ENG HSTR                          float64
TRANS CRD GPA MATH HSTR                         float64
TRANS CRD GPA LP SCI HSTR                       float64
GOVT RESPONSIBILITY - PROVIDE JOBS 2006        category
GOVT RESPNSBLTY - KEEP PRICES UND CTRL 2006    category
GOVT RESPNSBLTY - HLTH CARE FOR SICK 2006      category
GOVT RESPNSBLTY -PROV ELD LIV STAND 2006       category
GOVT RESPNSBLTY -PROV IND HELP 2006            category
GOVT RESPNSBLTY -PROV UNEMP LIV STAND 2006     category
GOVT RESPNSBLTY -REDUCE INC DIFF 2006          category
GOVT RESPNSBLTY -PROV COLL FIN AID 2006        category
GOVT RESPNSBLTY -PROV DECENT HOUSING 2006      category
GOVT RESPNSBLTY -PROTECT ENVIRONMENT 2006      category
CV_BA_CREDITS L1 2011                           float64
CV_COLLEGE_TYPE L1 2017                        category
CV_COLLEGE_TYPE L2 2017                        category
CV_COLLEGE_TYPE L3 2017                        category
CV_COLLEGE_TYPE L4 2017                        category
CV_COLLEGE_TYPE L5 2017                        category
CV_COLLEGE_TYPE L6 2017                        category
CV_HGC_EVER 2017                               category
CV_MARSTAT_COLLAPSED 2017                      category
CV_BIO_CHILD_HH 2017                            float64
CV_BIO_CHILD_NR 2017                            float64
DIPLOMA/DEGREE RCVD? L1 2017                   category
DIPLOMA/DEGREE RCVD? L2 2017                   category
DIPLOMA/DEGREE RCVD? L3 2017                   category
DIPLOMA/DEGREE RCVD? L4 2017                   category
EST INC WAGES, TIPS PAST YR 2017               category
HRS/WK R USES A COMPUTER 2017                  category
HRS/WK R WATCHES TELEVISION 2017               category
HRS/NIGHT R SLEEPS 2017                         float64
CVC_WKSWK_YR_ALL L99                            float64
dtype: object

In [32]:
nls97spss.columns = nls97spss.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]', '')

In [33]:
nls97spss.set_index('pubid__yth_id_code_1997', inplace=True)

In [34]:
# Simplify the process by applying the value labels from the beginning

nls97spss, metaspss = pyreadstat.read_sav('data/nls97.sav', apply_value_formats=True, formats_as_category=True)

In [35]:
nls97spss.columns = metaspss.column_labels

In [36]:
nls97spss.columns = nls97spss.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]', '')

In [37]:
nls97spss.dtypes

pubid__yth_id_code_1997                        float64
keysex_symbol_1997                            category
keybdate_my_symbol_1997                        float64
keybdate_my_symbol_1997                        float64
cv_sample_type_1997                           category
keyrace_ethnicity_symbol_1997                 category
trans_sat_verbal_hstr                          float64
trans_sat_math_hstr                            float64
trans_crd_gpa_overall_hstr                     float64
trans_crd_gpa_eng_hstr                         float64
trans_crd_gpa_math_hstr                        float64
trans_crd_gpa_lp_sci_hstr                      float64
govt_responsibility__provide_jobs_2006        category
govt_respnsblty__keep_prices_und_ctrl_2006    category
govt_respnsblty__hlth_care_for_sick_2006      category
govt_respnsblty_prov_eld_liv_stand_2006       category
govt_respnsblty_prov_ind_help_2006            category
govt_respnsblty_prov_unemp_liv_stand_2006     category
govt_respnsblty_reduce_inc_diff_2006          category
govt_respnsblty_prov_coll_fin_aid_2006        category
govt_respnsblty_prov_decent_housing_2006      category
govt_respnsblty_protect_environment_2006      category
cv_ba_credits_l1_2011                          float64
cv_college_type_l1_2017                       category
cv_college_type_l2_2017                       category
cv_college_type_l3_2017                       category
cv_college_type_l4_2017                       category
cv_college_type_l5_2017                       category
cv_college_type_l6_2017                       category
cv_hgc_ever_2017                              category
cv_marstat_collapsed_2017                     category
cv_bio_child_hh_2017                           float64
cv_bio_child_nr_2017                           float64
diplomadegree_rcvd_l1_2017                    category
diplomadegree_rcvd_l2_2017                    category
diplomadegree_rcvd_l3_2017                    category
diplomadegree_rcvd_l4_2017                    category
est_inc_wages_tips_past_yr_2017               category
hrswk_r_uses_a_computer_2017                  category
hrswk_r_watches_television_2017               category
hrsnight_r_sleeps_2017                         float64
cvc_wkswk_yr_all_l99                           float64
dtype: object

In [38]:
nls97spss.head()

,pubid__yth_id_code_1997,keysex_symbol_1997,keybdate_my_symbol_1997,keybdate_my_symbol_1997,...,hrswk_r_uses_a_computer_2017,hrswk_r_watches_television_2017,hrsnight_r_sleeps_2017,cvc_wkswk_yr_all_l99
0,1.00,Female,9.00,"1,981.00",...,NaN,NaN,nan,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [39]:
# Run frequencies on one of the columns and set the index:

nls97spss.govt_responsibility__provide_jobs_2006.value_counts(sort=False)

Definitely should be        454
Definitely should not be    300
Probably should be          617
Probably should not be      462
Name: govt_responsibility__provide_jobs_2006, dtype: int64

In [40]:
nls97spss.set_index('pubid__yth_id_code_1997', inplace=True)

## Import the Stata data, apply value labels, and improve the column headings

In [41]:
nls97stata, metastata = pyreadstat.read_dta('data/nls97.dta', apply_value_formats=True, formats_as_category=True)

In [42]:
nls97stata.columns = metastata.column_labels

In [43]:
nls97stata.columns = nls97stata.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]', '')

In [44]:
nls97stata.dtypes

pubid__yth_id_code_1997                        float64
keysex_symbol_1997                            category
keybdate_my_symbol_1997                        float64
keybdate_my_symbol_1997                        float64
cv_sample_type_1997                           category
keyrace_ethnicity_symbol_1997                 category
trans_sat_verbal_hstr                          float64
trans_sat_math_hstr                            float64
trans_crd_gpa_overall_hstr                     float64
trans_crd_gpa_eng_hstr                         float64
trans_crd_gpa_math_hstr                        float64
trans_crd_gpa_lp_sci_hstr                      float64
govt_responsibility__provide_jobs_2006        category
govt_respnsblty__keep_prices_und_ctrl_2006    category
govt_respnsblty__hlth_care_for_sick_2006      category
govt_respnsblty_prov_eld_liv_stand_2006       category
govt_respnsblty_prov_ind_help_2006            category
govt_respnsblty_prov_unemp_liv_stand_2006     category
govt_respnsblty_reduce_inc_diff_2006          category
govt_respnsblty_prov_coll_fin_aid_2006        category
govt_respnsblty_prov_decent_housing_2006      category
govt_respnsblty_protect_environment_2006      category
cv_ba_credits_l1_2011                          float64
cv_college_type_l1_2017                       category
cv_college_type_l2_2017                       category
cv_college_type_l3_2017                       category
cv_college_type_l4_2017                       category
cv_college_type_l5_2017                       category
cv_college_type_l6_2017                       category
cv_hgc_ever_2017                              category
cv_marstat_collapsed_2017                     category
cv_bio_child_hh_2017                           float64
cv_bio_child_nr_2017                           float64
diplomadegree_rcvd_l1_2017                    category
diplomadegree_rcvd_l2_2017                    category
diplomadegree_rcvd_l3_2017                    category
diplomadegree_rcvd_l4_2017                    category
est_inc_wages_tips_past_yr_2017               category
hrswk_r_uses_a_computer_2017                  category
hrswk_r_watches_television_2017               category
hrsnight_r_sleeps_2017                         float64
cvc_wkswk_yr_all_l99                           float64
dtype: object

In [45]:
nls97stata.head()

,pubid__yth_id_code_1997,keysex_symbol_1997,keybdate_my_symbol_1997,keybdate_my_symbol_1997,...,hrswk_r_uses_a_computer_2017,hrswk_r_watches_television_2017,hrsnight_r_sleeps_2017,cvc_wkswk_yr_all_l99
0,1.00,Female,9.00,"1,981.00",...,-5.00,-5.00,-5.00,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [46]:
nls97stata.govt_responsibility__provide_jobs_2006.value_counts(sort=False)

-5.0                        1425
-4.0                        5665
-2.0                          56
-1.0                           5
Definitely should be         454
Definitely should not be     300
Probably should be           617
Probably should not be       462
Name: govt_responsibility__provide_jobs_2006, dtype: int64

In [47]:
nls97stata.min()

pubid__yth_id_code_1997                     1.00
keysex_symbol_1997                        Female
keybdate_my_symbol_1997                     1.00
keybdate_my_symbol_1997                 1,980.00
cv_sample_type_1997              Cross-sectional
keyrace_ethnicity_symbol_1997              Black
trans_sat_verbal_hstr                      -4.00
trans_sat_math_hstr                        -4.00
trans_crd_gpa_overall_hstr                 -9.00
trans_crd_gpa_eng_hstr                     -9.00
trans_crd_gpa_math_hstr                    -9.00
trans_crd_gpa_lp_sci_hstr                  -9.00
cv_ba_credits_l1_2011                      -5.00
cv_bio_child_hh_2017                       -5.00
cv_bio_child_nr_2017                       -5.00
hrsnight_r_sleeps_2017                     -5.00
cvc_wkswk_yr_all_l99                       -4.00
dtype: object

In [48]:
nls97stata.replace(list(range(-9,0)), np.nan, inplace=True)

In [49]:
nls97stata.min()

pubid__yth_id_code_1997                     1.00
keysex_symbol_1997                        Female
keybdate_my_symbol_1997                     1.00
keybdate_my_symbol_1997                 1,980.00
cv_sample_type_1997              Cross-sectional
keyrace_ethnicity_symbol_1997              Black
trans_sat_verbal_hstr                      14.00
trans_sat_math_hstr                         7.00
trans_crd_gpa_overall_hstr                 10.00
trans_crd_gpa_eng_hstr                      0.00
trans_crd_gpa_math_hstr                     0.00
trans_crd_gpa_lp_sci_hstr                   0.00
cv_ba_credits_l1_2011                       0.00
cv_bio_child_hh_2017                        0.00
cv_bio_child_nr_2017                        0.00
hrsnight_r_sleeps_2017                      0.00
cvc_wkswk_yr_all_l99                        0.00
dtype: object

## Retrieve the SAS data, using the SAS catalog file for value labels

In [50]:
# The data values for SAS are stored in a catalog file. Setting the catalog file path and filename retrieves the value labels and applies them:

nls97sas, metasas = pyreadstat.read_sas7bdat('data/nls97.sas7bdat', catalog_file='data/nlsformats3.sas7bcat', formats_as_category=True)

In [51]:
nls97sas.columns = metasas.column_labels

In [52]:
nls97sas.columns = nls97sas.columns.str.lower().str.replace(' ','_').str.replace('[^a-z0-9_]', '')

In [53]:
nls97sas.head()

,pubid__yth_id_code_1997,keysex_symbol_1997,keybdate_my_symbol_1997,keybdate_my_symbol_1997,...,hrswk_r_uses_a_computer_2017,hrswk_r_watches_television_2017,hrsnight_r_sleeps_2017,cvc_wkswk_yr_all_l99
0,1.00,Female,9.00,"1,981.00",...,NaN,NaN,nan,52.00
1,2.00,Male,7.00,"1,982.00",...,4 to 6 hours a week,3 to 10 hours a week,6.00,0.00
2,3.00,Female,9.00,"1,983.00",...,10 hours or more a week,3 to 10 hours a week,6.00,0.00
3,4.00,Female,2.00,"1,981.00",...,1 to 3 hours a week,3 to 10 hours a week,6.00,4.00
4,5.00,Male,10.00,"1,982.00",...,Less than 1 hour a week,3 to 10 hours a week,5.00,12.00

In [54]:
nls97sas.keysex_symbol_1997.value_counts()

Male      4599
Female    4385
Name: keysex_symbol_1997, dtype: int64

In [55]:
nls97sas.set_index('pubid__yth_id_code_1997', inplace=True)

## Importing R data

In [59]:
import pprint
import pyreadr

In [60]:
nls97r = pyreadr.read_r('data/nls97.rds')[None]

In [61]:
nls97r.dtypes

R0000100    int32
R0536300    int32
R0536401    int32
R0536402    int32
R1235800    int32
R1482600    int32
R9793800    int32
R9793900    int32
R9871900    int32
R9872000    int32
R9872200    int32
R9872400    int32
S8646900    int32
S8647000    int32
S8647100    int32
S8647200    int32
S8647300    int32
S8647400    int32
S8647500    int32
S8647600    int32
S8647700    int32
S8647800    int32
T6651700    int32
U1836800    int32
U1836900    int32
U1837000    int32
U1837100    int32
U1837200    int32
U1837300    int32
U1845400    int32
U1852400    int32
U1852600    int32
U1852700    int32
U2166200    int32
U2166300    int32
U2166400    int32
U2166500    int32
U2857300    int32
U2962800    int32
U2962900    int32
U2963000    int32
Z9063900    int32
dtype: object

In [62]:
nls97r.head(10)

,R0000100,R0536300,R0536401,R0536402,...,U2962800,U2962900,U2963000,Z9063900
0,1,2,9,1981,...,-5,-5,-5,52
1,2,1,7,1982,...,4,2,6,0
2,3,2,9,1983,...,6,2,6,0
3,4,2,2,1981,...,3,2,6,4
4,5,1,10,1982,...,2,2,5,12
5,6,2,1,1982,...,4,2,6,6
6,7,1,4,1983,...,-5,-5,-5,0
7,8,2,6,1981,...,-5,-5,-5,39
8,9,1,10,1982,...,6,2,4,0
9,10,1,3,1984,...,6,2,6,0

## Set up dictionaries for value labels and column headings.
Load a dictionary that maps columns to the value labels and create a list of preferred column names as follows:

In [63]:
with open('data/nlscodes.txt', 'r') as reader:
    setvalues = eval(reader.read())

In [64]:
pprint.pprint(setvalues)

{'R0536300': {0.0: 'No Information', 1.0: 'Male', 2.0: 'Female'},
 'R1235800': {0.0: 'Oversample', 1.0: 'Cross-sectional'},
 'S8646900': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647000': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647100': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647200': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647300': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647400': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647500': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647600': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647700': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'S8647800': {1.0: '1. Definitely',
              2.0: '2. Probably ',
              3.0: '3. Probably not',
              4.0: '4. Definitely not'},
 'U1836800': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1836900': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1837000': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1837100': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1837200': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1837300': {1.0: 'Public ',
              2.0: 'Private not-for-profit',
              3.0: 'Private for-profit'},
 'U1845400': {0.0: 'NONE',
              1.0: 'A. 1ST GRADE',
              2.0: 'B. 2ND GRADE',
              3.0: 'C. 3RD GRADE',
              4.0: 'D. 4TH GRADE',
              5.0: 'E. 5TH GRADE',
              6.0: 'F. 6TH GRADE',
              7.0: 'G. 7TH GRADE',
              8.0: 'H. 8TH GRADE',
              9.0: 'I. 9TH GRADE',
              10.0: 'J. 10TH GRADE',
              11.0: 'K. 11TH GRADE',
              12.0: 'L. 12TH GRADE',
              13.0: 'M. 1ST YEAR COLLEGE',
              14.0: 'N. 2ND YEAR COLLEGE',
              15.0: 'O. 3RD YEAR COLLEGE',
              16.0: 'P. 4TH YEAR COLLEGE',
              17.0: 'Q. 5TH YEAR COLLEGE',
              18.0: 'R. 6TH YEAR COLLEGE',
              19.0: 'S. 7TH YEAR COLLEGE',
              20.0: 'T. 8TH YEAR COLLEGE OR MORE',
              95.0: '99. UNGRADED'},
 'U1852400': {0.0: 'Never-married',
              1.0: 'Married',
              2.0: 'Separated',
              3.0: 'Divorced',
              4.0: 'Widowed'},
 'U2166200': {1.0: '1. Associate/Junior College or two-year associate degree '
                   '(AA)',
              2.0: '2. Vocational or technical certificate',
              3.0: "3. Bachelor's degree (BA, BS or unspecified)",
              4.0: "4. Master's degree (MA, MBA, MS, MSW)",
              5.0: '5. Doctoral Degree (PhD)',
              6.0: '6. Professional Degree (MD, LLD, DDS, JD)',
              7.0: '7. No degree received',
              8.0: '8. OTHER (SPECIFY)',
              9.0: '9. GED',
              999.0: '999. UNCODEABLE'},
 'U2166300': {1.0: '1. Associate/Junior College or two-year associate degree '
                   '(AA)',
              2.0: '2. Vocational or technical certificate',
              3.0: "3. Bachelor's degree (BA, BS or unspecified)",
              4.0: "4. Master's degree (MA, MBA, MS, MSW)",
              5.0: '5. Doctoral Degree (PhD)',
              6.0: '6. Professional Degree (MD, LLD, DDS, JD)',
              7.0: '7. No degree received',
              8.0: '8. OTHER (SPECIFY)',
              9.0: '9. GED',
              999.0: '999. UNCODEABLE'},
 'U2166400': {1.0: '1. Associate/Junior College or two-year associate degree '
                   '(AA)',
              2.0: '2. Vocational or technical certificate',
              3.0: "3. Bachelor's degree (BA, BS or unspecified)",
              4.0: "4. Master's degree (MA, MBA, MS, MSW)",
              5.0: '5. Doctoral Degree (PhD)',
              6.0: '6. Professional Degree (MD, LLD, DDS, JD)',
              7.0: '7. No degree received',
              8.0: '8. OTHER (SPECIFY)',
              9.0: '9. GED',
              999.0: '999. UNCODEABLE'},
 'U2166500': {1.0: 'Associate/Junior College or two-year associate degree (AA)',
              2.0: '2. Vocational or technical certificate',
              3.0: "3. Bachelor's degree (BA, BS or unspecified)",
              4.0: "4. Master's degree (MA, MBA, MS, MSW)",
              5.0: '5. Doctoral Degree (PhD)',
              6.0: '6. Professional Degree (MD, LLD, DDS, JD)',
              7.0: '7. No degree received',
              8.0: '8. OTHER (SPECIFY)',
              9.0: '9. GED',
              999.0: '999. UNCODEABLE'},
 'U2857300': {1.0: 'A. $1 - $5,000',
              2.0: 'B. $5,001 - $10,000',
              3.0: 'C. $10,001 - $25,000',
              4.0: 'D. $25,001 - $50,000',
              5.0: 'E. $50,001 - $100,000',
              6.0: 'F. $100,001 - $250,000',
              7.0: 'G. More than $250,000'},
 'U2962800': {1.0: '1. None',
              2.0: '2. Less than 1 hour a week',
              3.0: '3. 1 to 3 hours a week',
              4.0: '4. 4 to 6 hours a week',
              5.0: '5. 7 to 9 hours a week',
              6.0: '6. 10 hours or more a week'},
 'U2962900': {1.0: '1. Less than 2 hours per week',
              2.0: '2. 3 to 10 hours a week',
              3.0: '3. 11 to 20 hours a week',
              4.0: '4. 21 to 30 hours a week',
              5.0: '5. 31 to 40 hours a week',
              6.0: '6. More than 40 hours a week'}}

In [65]:
newcols = ['personid','gender','birthmonth','birthyear',
           'sampletype',  'category','satverbal','satmath',
           'gpaoverall','gpaeng','gpamath','gpascience','govjobs',
           'govprices','govhealth','goveld','govind','govunemp',
           'govinc','govcollege','govhousing','govenvironment',
           'bacredits','coltype1','coltype2','coltype3','coltype4',
           'coltype5','coltype6','highestgrade','maritalstatus',
           'childnumhome','childnumaway','degreecol1',
           'degreecol2','degreecol3','degreecol4','wageincome',
           'weeklyhrscomputer','weeklyhrstv',
           'nightlyhrssleep','weeksworkedlastyear']

In [66]:
# Set value labels and missing values, and change selected columns to category data type.
nls97r.replace(setvalues, inplace=True)

In [67]:
nls97r.head()

,R0000100,R0536300,R0536401,R0536402,...,U2962800,U2962900,U2963000,Z9063900
0,1,Female,9,1981,...,-5,-5,-5,52
1,2,Male,7,1982,...,4. 4 to 6 hours a week,2. 3 to 10 hours a week,6,0
2,3,Female,9,1983,...,6. 10 hours or more a week,2. 3 to 10 hours a week,6,0
3,4,Female,2,1981,...,3. 1 to 3 hours a week,2. 3 to 10 hours a week,6,4
4,5,Male,10,1982,...,2. Less than 1 hour a week,2. 3 to 10 hours a week,5,12

In [68]:
nls97r.replace(list(range(-9,0)), np.nan, inplace=True)

In [69]:
for col in nls97r[[k for k in setvalues]].columns:
    nls97r[col] = nls97r[col].astype('category')

In [70]:
nls97r.dtypes

R0000100       int32
R0536300    category
R0536401       int32
R0536402       int32
R1235800    category
R1482600       int32
R9793800     float64
R9793900     float64
R9871900     float64
R9872000     float64
R9872200     float64
R9872400     float64
S8646900    category
S8647000    category
S8647100    category
S8647200    category
S8647300    category
S8647400    category
S8647500    category
S8647600    category
S8647700    category
S8647800    category
T6651700     float64
U1836800    category
U1836900    category
U1837000    category
U1837100    category
U1837200    category
U1837300    category
U1845400    category
U1852400    category
U1852600     float64
U1852700     float64
U2166200    category
U2166300    category
U2166400    category
U2166500    category
U2857300    category
U2962800    category
U2962900    category
U2963000     float64
Z9063900     float64
dtype: object

In [71]:
# Set meaningful column headings

nls97r.columns = newcols

In [72]:
nls97r.dtypes

personid                  int32
gender                 category
birthmonth                int32
birthyear                 int32
sampletype             category
category                  int32
satverbal               float64
satmath                 float64
gpaoverall              float64
gpaeng                  float64
gpamath                 float64
gpascience              float64
govjobs                category
govprices              category
govhealth              category
goveld                 category
govind                 category
govunemp               category
govinc                 category
govcollege             category
govhousing             category
govenvironment         category
bacredits               float64
coltype1               category
coltype2               category
coltype3               category
coltype4               category
coltype5               category
coltype6               category
highestgrade           category
maritalstatus          category
childnumhome            float64
childnumaway            float64
degreecol1             category
degreecol2             category
degreecol3             category
degreecol4             category
wageincome             category
weeklyhrscomputer      category
weeklyhrstv            category
nightlyhrssleep         float64
weeksworkedlastyear     float64
dtype: object

In [74]:
import pyarrow

In [75]:
landtemps = pd.read_csv('data/landtempssample.csv',names=['stationid','year','month','avgtemp','latitude',
        'longitude','elevation','station','countryid','country'],skiprows=1,parse_dates=[['month','year']],low_memory=False)

In [76]:
landtemps.rename(columns={'month_year':'measuredate'}, inplace=True)

In [77]:
landtemps.dropna(subset=['avgtemp'], inplace=True)

In [78]:
landtemps.dtypes

measuredate    datetime64[ns]
stationid              object
avgtemp               float64
latitude              float64
longitude             float64
elevation             float64
station                object
countryid              object
country                object
dtype: object

In [79]:
landtemps.set_index(['measuredate','stationid'], inplace=True)

In [80]:
# Write extreme values for temperature to CSV and Excel files;

extremevals = landtemps[(landtemps.avgtemp <
landtemps.avgtemp.quantile(.001)) | (landtemps.avgtemp
> landtemps.avgtemp.quantile(.999))]

In [81]:
extremevals.shape

(171, 7)

In [82]:
extremevals.sample(7)

,,avgtemp,latitude,longitude,elevation,station,countryid,country
measuredate,stationid,,,,,,,
2018-08-01,USC00264439,34.93,36.05,-115.18,693.40,LAS_VEGAS_WFO,US,United States
1918-07-01,PKXLT869883,34.49,32.00,71.08,175.00,DERA_ISMAIL_KHAN,PK,Pakistan
1993-07-01,MR000061421,35.98,20.52,-13.07,224.00,ATAR,MR,Mauritania
1980-07-01,ER000063043,36.38,13.07,42.72,14.00,ASSAB,ER,Eritrea
1891-06-01,INXLT131334,35.51,25.03,79.48,231.00,NOWGONG,IN,India
1973-02-01,RSM00024136,-34.99,68.62,118.33,78.00,SUHANA,RS,Russia
1971-06-01,PKXLT416671,35.70,27.70,68.87,67.00,SUKKUR,PK,Pakistan

In [83]:
# Save to pickle and feather files

landtemps.to_pickle('data/landtemps.pkl')

In [84]:
landtemps.reset_index(inplace=True)

In [85]:
landtemps.to_feather("data/landtemps.ftr")

In [86]:
# Load the pickle and feather files we just saved.
# Notice that our index was preserved when saving and loading the pickle file:

landtemps = pd.read_pickle('data/landtemps.pkl')

landtemps.head(2).T

measuredate     2000-04-01  1940-05-01
stationid      USS0010K01S CI000085406
avgtemp               5.27       18.04
latitude             39.90      -18.35
longitude          -110.75      -70.33
elevation         2,773.70       58.00
station      INDIAN_CANYON       ARICA
countryid               US          CI
country      United States       Chile

In [87]:
landtemps = pd.read_feather("data/landtemps.ftr")

In [88]:
landtemps.head(2).T

                               0                    1
measuredate  2000-04-01 00:00:00  1940-05-01 00:00:00
stationid            USS0010K01S          CI000085406
avgtemp                     5.27                18.04
latitude                   39.90               -18.35
longitude                -110.75               -70.33
elevation               2,773.70                58.00
station            INDIAN_CANYON                ARICA
countryid                     US                   CI
country            United States                Chile